app/controllers/likes_controller.rb

    def index
        render json: Like.all
---
SELECT "likes".* FROM "likes"