app/controllers/pets_controller.rb

    def index
        pets = Pet.all
        pets.each do |pet|
            pet.likes = pet.liker_pets.length
            pet.save
---
SELECT "pets".* FROM "pets"
INSERT INTO "pets" ("name", "species", "species_availability", "ownership", "diet", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "pets" SET "likes" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["likes", 1], ["updated_at", "2018-10-24 17:08:31.963435"], ["id", 5]]

    def show
        pet = Pet.find(params[:id])
        likes = pet.liker_pets.length
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def create
        pet = Pet.create(pets_params)
---
INSERT INTO "pets" ("name", "species", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "1"], ["species", "2"], ["user_id", 5], ["created_at", "2018-10-24 19:29:25.593718"], ["updated_at", "2018-10-24 19:29:25.593718"]]

    def update
        # create no like using liker_id and liked_id
        like = Like.create(liker_id: params[:liker_id], liked_id: params[:liked_id])
        # byebug
        # number of likers for liked pet
        number_of_likes = Pet.find(params[:liked_id]).liker_pets.length
---
INSERT INTO "likes" ("liker_id", "liked_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["liker_id", 7], ["liked_id", 6], ["created_at", "2018-10-24 18:15:05.806944"], ["updated_at", "2018-10-24 18:15:05.806944"]]
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."liked_id" = ?  [["liked_id", 6]]

    def destroy
        puts params
        pet = Pet.find(params[:id])
        pet.delete
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 8]]