app/controllers/users_controller.rb

    def create
        user = User.create!(user_params)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2018-10-24 20:11:36.849873"], ["updated_at", "2018-10-24 20:11:36.849873"]]

    def destroy
        puts params
        user = User.find(params[:id])
        user.delete
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 13]]